--------------------------------------------------------------------------------
--     作者:yjp
--     文件描述:定义跟C#交互、跟平台交互的事件、以及前后端同行的事件协议号(小游戏独有)
--     创建时间:2022/04/21 
--------------------------------------------------------------------------------
--小游戏和平台通信的消息
EEvent.PipeMsg = {
	----------------------------------公共--------------------------------------
	Broadcast = 1, --广播
	GameInfo = 3, --游戏信息
	GameEvent = 4, --游戏事件
	UIEvent = 5, --UI事件
	KeyEvent = 6, --按键事件
	Setting = 7, --游戏设置
	----------------------------------游戏--------------------------------------
	Prepare = 51, --准备阶段
    OneRound = 52, --玩一局
    DebugModel = 53, --调试信息
	EndRound = 54, --结束一局
	PreviewBet = 55, --预览
}
