--------------------------------------------------------------------------------
--     作者:yjp
--     文件描述:一些BaseLogic中常用的常量枚举定义
--     创建时间:2021/09/24 
--------------------------------------------------------------------------------
Const.GUIWeight = 
{
    Bottom = 1,
    Main = 2,
    Pop = 3,
    Alert = 4,
    Message = 5,
    Loading = 6,
    GM = 7,
    Top = 8,
    Count = 9,
    [1] = "Bottom",
    [2] = "Main",
    [3] = "Pop",
    [4] = "Alert",
    [5] = "Message",
    [6] = "Loading",
    [7] = "GM",
    [8] = "Top",
}